import React from "react";
import BreadCrumbs from "../../misc/BreadCrumbs/BreadCrumbs";
import s from "./DeliveryInfo.module.css";
import { ReactComponent as Home } from "../../assets/home.svg";

const DeliveryInfo = (props) => {
  const breadCrumbsItems = [
    {
      name: "Головна",
      path: "/",
      icon: <Home className={s.bread__crumbs} />,
    },
    { name: "Достака і оплата", path: "/delivery-inf" },
  ];
  return (
    <div>
      <div className={s.title__container}>
        <h4 className={s.title}>ДОСТАВКА І ОПЛАТА</h4>
        <BreadCrumbs items={breadCrumbsItems} />
      </div>
      <div className={s.garant}>
        <h3>Замовлення товарів:</h3>
        <p>
          Для Вашої зручності інтернет-магазин "Медтехніка" передбачив два
          способи замовлення товарів: на САЙТІ – 24 години на добу, 7 днів на
          тиждень знайдіть виріб, який Вас цікавить, додайте його в кошик своїх
          покупок і пройдіть за посиланням Кошик для оформлення замовлення; за
          ТЕЛЕФОНОМ, 7 днів на тиждень із 8.00 до 20.00 знайдіть виріб, який Вас
          цікавить, і обов'язково зв'яжіться з нами за номерам: + 380(96) 39 55
          491 для оформлення замовлення.
        </p>
        <h3>Оплата замовлення</h3>
        <p>
          Для Вашої зручності інтернет-магазин "Рідні Медтехніка" передбачив
          кілька способів оплати виробу, який Ви вибрали:
        </p>
        <h3>У нашому магазині "Медтехніка"</h3>
        <h5>- У Тернополі (вулиця Гуго Коллонтая 2)</h5>
        <h3>Банківським переказом (за фактом оформлення замовлення)</h3>
        <p>
          під час оформлення замовлення з будь-якого міста України Ви можете
          оплатити товар, який Ви замовили, через LiqPay або банківським
          переказом. Квитанцію з нашими реквізитами можна роздрукувати після
          оформлення замовлення на сайті.
        </p>
      </div>
    </div>
  );
};

export default DeliveryInfo;
